{"code": "19-421", "name": "Emerging Energy Policies", "base_name": "Emerging Energy Policies", "units": 9.0, "min_units": 9.0, "max_units": 9.0, "short_name": "EMG ENERGY", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [{"semester": 1, "year": 2017}, {"semester": 1, "year": 2018}, {"semester": 1, "year": 2019}, {"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "Interested in whats happening in energy policy and how to analyze potential policy options in response  Focusing on current hot topics in energy policy, students will learn the basic principles of public policy analysis and underlying techniques such as program evaluation, cost benefit analysis, life cycle analysis, prince analysis, and risk analysis as well as the variety of policy mechanisms available. Class time will include a combination of faculty and guest speaker lectures, discussion of issues, videos, and problem solving.  Students will review and edit Wikipedia entries on an energy policy topic of their choice, and then analyze policy options resulting in an executive summary or paper on that topic.  While the course has no prerequisites, students should feel comfortable with scientific and technical topics. Upon completion of this course, students should have a deeper and more strategic understanding of the opportunities and challenges associated with emerging energy policies. Open to seniors. Open to juniors with permission only.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "intermittent", "type": "INFO"}], "website": null, "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "repeat_limit_attempts": null, "repeat_limit_credits": null, "catalog_levels": [], "skills": [], "attributes": [], "custom_fields": {"goals": null, "key_topics": "Through readings, discussion, and assignments the course will enable students to:\n\tunderstand the roles of society, political institutions and regulatory agencies, non-governmental organizations (NGOs), scientific information, economics and business, and technology on developing energy policies;\n\tgrasp the interplay of scientific, political, and economic factors in the formation of energy policy in the United States at various levels;\n\tcomprehend the interactions of legislative and regulatory frameworks in shaping energy policy; and,\n\tdevelop an understanding of set of tools used to judge the need, the sufficiency of, and the effectiveness of energy policy.", "prerequisite_knowledge": null, "assessment_structure": "(1)\tClass participation: (10% of your grade). The grade is comprised of the following components:\n\na.\tNews item discussion.\n\ni.\tCurrent news Items related to energy policy and energy developments are to be brought to every class except the first class (see below for addition exceptions). Print the item and identify yourself on it. These are due to me before class begins via hard copy or email (time of delivery of from the CMU email system is the final arbiter of whether late or not). Emailed items are to be in the form of a pdf. Late submissions are not accepted for this grade. This is a +/- assessment. You either turned one in or you don't. Your total score with be the fraction of total news items received based on the total number required.\n\nii.\tBe prepared to provide a verbal synopsis in class, as we will spend five or 10 mins at the beginning of the class discussing your news items.\n\niii.\tNote: News items are not required for classes where we have a guest lecturer. I want to give the guest to have the complete class time to develop their topic.\n\nb.\tDiscussions during class about the current lecture material.\n\ni.\tMuch can be learned by discussing the lecture content during class. I will many times defer to the class to discuss a question and explore the many alternatives that present themselves in a policy context. Even without questions, I intend to ask the class for their opinions on many areas that we discuss. A tally sheet will be kept based on a sign in sheet for each class.\n\n(2)\tDiscussion points: (10% of your grade). The grade is comprised of the following components:\n\na.\tThe energy field is broad and combined with policy leads to a the subject that has an enormous content. I have asked a number of CMU and outside experts to present relevant information about their areas of expertise. Due before the beginning of the class following every guest lecture, is a written hard copy or word file (.doc or docx) ema", "relevance": null, "learning_resources": "There are no required texts for these courses. I will provide you with reading materials related to the lecture when appropriate and suggested follow-up readings to delve deeper into the subject.", "extra_time_commitment": null}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}