{"code": "36-309", "name": "Experimental Design for Behavioral & Social Sciences", "base_name": "Experimental Design for Behavioral & Social Sciences", "units": 9.0, "min_units": 9.0, "max_units": 9.0, "short_name": "EX DES BEHA SOC SCI", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [{"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}, {"semester": 1, "year": 2023}, {"semester": 1, "year": 2024}], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [{"code": "85-309", "id": 10064, "name": "Statistical Concepts and Methods for Behavioral and Social Science", "units": 9.0}], "equiv": [], "long_desc": "This course focuses on the statistical aspects of the design and analysis stages of planned experiments. The design stage focuses on determining how experimental factors are allocated, the sample size necessary to achieve adequate statistical power, and how subjectsvariables are measured. The analysis stage focuses on how data are collected and which statistical models are most appropriate to answer the research questions of interest. Although students will have to do some computer programming to implement these statistical techniques, the most important aspect of the course will be on interpreting analyses results e.g., whether a given analysis is appropriate, to what extent that analysis can answer research questions of interest, and the broader implications of an analysis within the context of the experiment. In addition to a weekly lecture, students will attend a computer lab once a week to get guidance and handson practice implementing statistical techniques we learn in class.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "specific_sem", "type": "INFO", "sem": 1}, {"name": "specific_sem", "type": "INFO", "sem": 3}], "website": "http://www.stat.cmu.edu/academics/courselist", "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "repeat_limit_attempts": null, "repeat_limit_credits": null, "catalog_levels": [], "skills": [{"name": "Variance", "slug": "variance", "id": 313}, {"name": "Analysis Of Variance", "slug": "analysis-of-variance", "id": 317}, {"name": "Experimental", "slug": "experimental", "id": 1843}], "attributes": [], "custom_fields": {"goals": "Given a particular research question, students will be able to characterize the type of experiment that can best answer that research question. For example, which subjects and experimental factors should be studied, and how should subjects be allocated to different experimental factors Furthermore, given a dataset produced by such an experiment, students will know how to conduct the appropriate statistical analysis to estimate effects of interest, quantify uncertainty in those estimates, and interpret these statistical results within the context of a particular research problem.", "key_topics": "t-tests, ANOVA, regression and ANCOVA, power analysis, multiple hypothesis testing, and repeated measures analyses for randomized experiments, as well as various exploratory data analysis tools for experiments.", "prerequisite_knowledge": "Some previous exposure to hypothesis testing, p-values, and confidence intervals is essential. Some previous exposure to regression is also helpful but not strictly necessary.", "assessment_structure": "Weekly homework assignments and computer labs, two midterm exams, and a final exam.", "relevance": "Students will learn how to design and analyze real experiments, which are ubiquitous in most fields of study. The course involves a lot of hands-on experience analyzing real data from many types of experiments, so students will walk away with a great deal of knowledge and experience under their belt after taking this course.", "learning_resources": "Lecture slides, free textbook, computer labs, and case studies of real datasets.", "extra_time_commitment": "None expected."}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}