{"code": "70-339", "name": "FinTech", "base_name": "FinTech", "units": 9.0, "min_units": 9.0, "max_units": 9.0, "short_name": "FINTECH", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [{"semester": 2, "year": 2016}, {"semester": 1, "year": 2016}, {"semester": 1, "year": 2018}, {"semester": 2, "year": 2021}], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "The financial services industry is a leader in the use of information technology. Firms in banking, securities, investments, insurance and financial marketplaces are among the most information intensive and innovative users of technology. The course will examine the role and potential of technology in this industry. The course begins with a description of the financial markets, specifically equity, foreign exchange, and derivatives, and the systems that enable them. It considers exchanges, ECNs, ATSs Order Management Systems, Straight through Processing, Fix Protocol, and post trading clearance and settlement. It covers the design, evaluation and execution of popular trading strategies that are used by professionals in the various markets. There is increasing interest, in particular, on systematic trading strategies and execution systems because of their scalability and transparency. The course covers both Algorithmic and High Frequency Trading and analyzes issues regarding latency, scalability, and reliability. This course may use thirdparty course material that is not available for individual purchase from the publisher.   If so, the thirdparty course material will be secured and provided by the Tepper School to students enrolled in the course, and students enrolled in the course will be required to pay to the University the associated additional course materials fee for the thirdparty course material provided.   The amount of the course materials fee is dependent on the Universitys cost of the particular materials provided, and typically ranges from 13 to 75.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "intermittent", "type": "INFO"}], "website": null, "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "repeat_limit_attempts": null, "repeat_limit_credits": null, "catalog_levels": [], "skills": [{"name": "Design Strategy Trading", "slug": "design-strategy-trading", "id": 1853}], "attributes": [], "custom_fields": {"goals": "Understand technologies underlying cryptocurrencies and blockchains Understand how machine learning and AI can be used in Finance Understand the challenges of cyber security.", "key_topics": "Blockchain technologies; Machine learning and AI applications in finance; Cyber Security challenges in financial systems", "prerequisite_knowledge": "Basic calculus and probability theory", "assessment_structure": "There will be four assignments, 1 or 2 presentations, and a final exam.", "relevance": "As FinTech continues to offer alternatives to financial services traditionally offered by banks, students who seek to get their degrees in business undergraduate, benefit from familiarizing themselves with such alternatives and learning what challenges these new alternatives create for banks.", "learning_resources": "There are three recommended (but not required) books, and lecture slides.", "extra_time_commitment": "The time they need to spend to solve and submit their assignments."}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}