{"code": "70-480", "name": "International Marketing", "base_name": "International Marketing", "units": 9.0, "min_units": 9.0, "max_units": 9.0, "short_name": "INTERNTNL MARKETING", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1, 2], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [{"semester": 2, "year": 2016}], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [{"semester": 2, "year": 2017}, {"semester": 2, "year": 2018}, {"semester": 2, "year": 2019}, {"semester": 2, "year": 2020}, {"semester": 2, "year": 2021}], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [{"code": "70-381", "id": 5717, "name": "Marketing I", "units": 9.0}], "anti_reqs": [], "equiv": [], "long_desc": "This course is designed to provide students with a basic understanding of global marketing opportunities, key issues, and strategies. It introduces the main characteristics of international markets and addresses the impact of global environmental factors economic, social, legal, and cultural on marketing decisions such as market entry, product development, pricing, promotion, and distribution.  The objective of the course is to help students acquire knowledge of major international marketing concepts and develop crosscultural sensitivities and skills that would enable them to identify, analyze, and solve international marketing problems. This course may use thirdparty course material that is not available for individual purchase from the publisher.   If so, the thirdparty course material will be secured and provided by the Tepper School to students enrolled in the course, and students enrolled in the course will be required to pay to the University the associated additional course materials fee for the thirdparty course material provided.   The amount of the course materials fee is dependent on the Universitys cost of the particular materials provided, and typically ranges from 13 to 75.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "intermittent", "type": "INFO"}], "website": null, "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "repeat_limit_attempts": null, "repeat_limit_credits": null, "catalog_levels": [], "skills": [{"name": "Promotional Design", "slug": "promotional-design", "id": 1539}, {"name": "Marketing", "slug": "marketing", "id": 1839}], "attributes": [], "custom_fields": {"goals": "To improve your problem definition skills. You will discover why, when and how to use marketing tools. To effectively analyze international marketing problems by considering corporate data, marketing research, organizational perspectives and other information and by creating a coherent plan for acting upon that information. To understand the differences between marketing and selling. To learn how to keep things simple and focus on the real issues. Its easy to get lost in overanalyzing marketing problems. A good marketer is someone who knows the art and science of persuading a target audience. Apply the principles of international marketing through a client project completing an important marketing project for an organization engaged in international marketing.", "key_topics": "The course is built around this modified marketing model with each box representing a unique topic:\n\nThrough the lens of the global environment¿and using a research-based approach to each subdiscipline of marketing, the course covers important topics such as branding, how to develop visual process models to simplify complex marketing challenges, techniques for discovering competitor strategies, how to draft a strategic marketing plan, ways to encourage selling beyond the traditional \"sales person\" role, how to position the firm, establishing pricing policies, understanding what marketing tactics typically work best together, basic selling strategies and how to measure and marketing return on investment.", "prerequisite_knowledge": "In addition to course prerequisites, students should be familiar with Excel and marketing research and presenting.", "assessment_structure": "Students can earn points in multiple ways including agency shootouts (international case competitions) and a project for a real organization who is facing an international marketing challenge. Additionally, short quizzes and attendance help encourage participation and engagement.", "relevance": "This course covers marketing principles in a global content and helps students develop a well-rounded, big picture understanding of the marketing challenges so that they can advance their careers in marketing, branding, entrepreneurship and other areas.", "learning_resources": "All course materials are provided by your instructor as part of the course (no cost to students, including books, workbooks, sample data files, PowerPoints and other materials available on Canvas).", "extra_time_commitment": "For the client projects, students may need to do visits, calls or other meetings to effectively complete their assignment. Whenever possible, these are scheduled to ensure as much convenience is scheduling as possible."}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}