{"code": "76-259", "name": "Film History", "base_name": "Film History", "units": 9.0, "min_units": 9.0, "max_units": 9.0, "short_name": "FILM HISTORY", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [{"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}, {"semester": 1, "year": 2023}, {"semester": 1, "year": 2024}], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "This introductory course will focus on the history of the American film industry, 19301980. On most weeks, we will screen two films that reflect the most important genres and most enduring achievements of the era. We will be concerned with understanding how the studio system produced and marketed these works, and how that system changed significantly from the 1950s1970s. By focusing on individual studios for example, MGM and Warner Bros. as test cases, the class will also examine how particular companies produced films of a certain type in terms of such parameters as genre, theme, player, class address, andor style. Readings will deal with the history of Hollywood, the various films, stars andor filmmakers considered, as well theoreticalcritical issues such as authorship, reception, and high vs. low culture. Students will learn important skills for film history, including reception study, archival research, and contextual analysis. Grades will be based on three papers that require different kinds of historical research, a midterm, and a final.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "specific_sem", "type": "INFO", "sem": 1}], "website": null, "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "repeat_limit_attempts": null, "repeat_limit_credits": null, "catalog_levels": [], "skills": [], "attributes": [], "custom_fields": {"goals": "1.Knowledge Goals\n1.1. Knowledge of the history of the studio and New Hollywood eras of filmmaking.\n1.2. Knowledge of changing social and political conditions that are represented in or which may have helped produce these films.\n1.3. Knowledge of the formal characteristics of the different genres and stylistic variations of studio era films.\n2. Development of Skills and Analytic Abilities\n2.1. The ability to do research using primary sources, specifically archives of film history.\n2.2. The ability to make use of secondary sources, such as and historical scholarship on film, in argumentatively effective papers.\n2.3 Identify the historical conditions that are represented in and that helped produce the films we study and ask similar questions about other films they view.\n2.4 Analyze changes in a films reception over time.\n2.5. The ability to write argumentatively effective papers displaying your readings and explaining your analyses.\n3. Development of Values and Tastes\n3.1 The development of an appreciation for the styles and forms of different historical periods.\n3.2. The development of clearer and stronger tastes in films.", "key_topics": "Hollywood, film industry and studios, directors, genres, styles, social and political context, historical research", "prerequisite_knowledge": null, "assessment_structure": "Three papers, a midterm (two short essays), and a final exam (two short essays). Students also write regular commentaries on the readings.", "relevance": "Dietrich GenEd Prior to Fall 2021: Reflecting\n\n\n\nDietrich GenEd After Fall 2021: Contextual Thinking\n\n\n\nRequired for Film and Visual media majors\n\n\n\n\n\n\n\nDevelop appreciation of classic films, as well all future films.", "learning_resources": "Several textbooks, plus reading available on Canvas. Most films are available to stream online via the CMU Library. Additional films may be available in the Video Collection in Hunt Library.", "extra_time_commitment": null}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}