{"code": "76-284", "name": "Rhetoric & Storytelling", "base_name": "Rhetoric & Storytelling", "units": 9.0, "min_units": 9.0, "max_units": 9.0, "short_name": "RHET & STORYTELLING", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [{"semester": 2, "year": 2021}], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "What are stories and why do we tell them What purpose do they serve What makes a story true What effect do stories have on those who hear them In this course, we will ask how narratives work rhetorically to shape how we perceive and encounter events, movements, places, and experiences. Students can expect to read and discuss narrative theories and practice employing these theories to analyze story artifacts, such as political speeches, newspaper or magazine articles, podcasts, and oral histories. During the semester, we will explore and analyze the way stories surrounding events like September 11 or movements like metoo or Black Lives Matter work or dont to influence and persuade. Students will consider the stories that infuse recent or local subjects of interest and investigate the effect such narratives have on contemporary contexts. Any student who is interested in developing a critical awareness of the ways storytelling influences and shapes our thinking as well as those who want to enhance their analytical toolkit will benefit from this course.  Most remote class sessions will involve guided student discussions of narrative concepts and theories, individual and collaborative activities to analyze story artifacts, and opportunities to reflect. Weekly assignments will include concept notes, short analyses, and other inclass activities to practice course skills. The course will culminate in a final project portfolio where students will explore stories that shape a selected social or cultural theme, event, or movement. This course meets the Dietrich College Communicating Gen Ed requirement.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "intermittent", "type": "INFO"}], "website": null, "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "repeat_limit_attempts": null, "repeat_limit_credits": null, "catalog_levels": [], "skills": [], "attributes": [{"name": "discussion intensive", "id": 2, "type": "attribute"}, {"name": "diversity", "id": 3, "type": "attribute"}, {"name": "communication & presentation", "id": 19, "type": "attribute"}, {"name": "equity & inclusion", "id": 23, "type": "attribute"}], "custom_fields": {"goals": "Describe and classify narrative concepts as rhetorical strategies.\nBuild an analytical toolkit for examining stories as rhetorical artifacts.\nAsk relevant questions about the persuasive power of stories, the roles they can play in social, cultural, or political movements, and their uses as rhetorical devices.\nDiscuss, interpret, and analyze story collections within the context of other social andor historical factors.", "key_topics": "Storytelling; narrative and rhetorical concepts such as narrative time, selection, events, and characters; social and political movements; critical thinking and analysis", "prerequisite_knowledge": "basic academic writing (FYW course)", "assessment_structure": "concept notes, low-stakes homework assignments, in-class practice and participation, final project", "relevance": "This course is an opportunity to practice and develop a critical awareness of the ways storytelling influences and shapes our thinking. It is also a chance to enhance their analytical toolkit and critical thinking. We will also practice writing and analytical skills.", "learning_resources": "Canvas, texts, models, story artifacts", "extra_time_commitment": null}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}