{"code": "76-374", "name": "Mediated Narrative", "base_name": "Mediated Narrative", "units": 9.0, "min_units": 9.0, "max_units": 9.0, "short_name": "MEDIATED NARRATIVE", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [{"semester": 2, "year": 2020}, {"semester": 2, "year": 2021}, {"semester": 2, "year": 2022}, {"semester": 2, "year": 2023}, {"semester": 2, "year": 2024}], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "We are offering the opportunity to travel into the future, build it, and represent it increative and critical ways. The Mediated Narrative Futuristic Explorations courseaims to explore the concept of the future, analyze its representations, and createa media project based on potential utopiandystopian areas of human progressand evolution. Students will have to recreate and represent their own visions ofthe future through a media project. Essential to the research and development ofthe class is the concept of humanity and empathy within a technological socialworld. Ideas such as reality ahead of schedule high tech, low life neon andcorporate dystopias cyberpunk posthuman sustainability etc, will beanalyzed and discussed in class. Concepts of civilization, the cityscape, theindividual, the body and the mind will be examined as we have seen technologyand society evolve. During the 2024 spring semester there will be two onsitevisits to historical places that under similar idealist social premises of the futurehave embodied diverse existential outcomes a The city of Arcosanti in theArizona dessert b The Old Economy Village in Pennsylvania. Both placesrepresent a utopian philosophy of life which attempted to be in synchronicity witheveryday life. The idea is to map traditional futuristic themes and styles and findnew ways to represent them based on the needs and contradictions in ourpresent world.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "specific_sem", "type": "INFO", "sem": 2}], "website": null, "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "repeat_limit_attempts": null, "repeat_limit_credits": null, "catalog_levels": [], "skills": [{"name": "Creative Writing", "slug": "creative-writing", "id": 1208}], "attributes": [], "custom_fields": {"goals": "Students will produce a videomedia project based on their understanding of the future and ideas on utopic and dystopic examples experienced through exploratory on site visits Arcosantii and Old Economy Village during the course.", "key_topics": "The future. Utopia/Dystopia. Architecture, social issues, media representation and creative media production..", "prerequisite_knowledge": "Some basic knowledge of media and documentary production (video, sound. graphics, art, writing, etc).", "assessment_structure": null, "relevance": "The future and the representation of the future is a subject relevant to any new generation to become.", "learning_resources": null, "extra_time_commitment": "A visit to the city of Arcosanti in Arizona will be scheduled during the Spring break of 2024."}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}