{"code": "80-254", "name": "Analytic Philosophy", "base_name": "Analytic Philosophy", "units": 9.0, "min_units": 9.0, "max_units": 9.0, "short_name": "ANALYTIC PHILOSOPHY", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [{"semester": 1, "year": 2019}, {"semester": 2, "year": 2021}], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "This course examines the revolutionary impact of philosophy at the turn of the 20th century on contemporary thought and progress. By the 1920s some scientists and philosophers became hopeful that the end of the long tradition of philosophical deadlock was finally within reach. Buoyed in particular by Einsteins theory of relativity and the invention of modern logic, they created a new kind of philosophy with the goal of applying logical and empirical methods to philosophical problems. This new approach led to new puzzles and paradoxes, along with a focus on the age old question of what can be known and what is meaningful. The modern fields of linguistics, cognitive science, and information and computer sciences all owe a debt to these sources, as does of course contemporary philosophy. Our quest will be to understand both what authors like Frege, Russell, and the Vienna Circle were up to in the first place, and how their work contributed to the world we live in today.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "intermittent", "type": "INFO"}], "website": null, "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "repeat_limit_attempts": null, "repeat_limit_credits": null, "catalog_levels": [], "skills": [{"name": "Philosophy", "slug": "philosophy", "id": 1263}, {"name": "Contemporary", "slug": "contemporary", "id": 1775}, {"name": "Modern/Contemporary", "slug": "moderncontemporary", "id": 1825}], "attributes": [{"name": "discussion intensive", "id": 2, "type": "attribute"}, {"name": "reading intensive", "id": 13, "type": "attribute"}], "custom_fields": {"goals": "Students will gain an appreciation for some of the key ideas and foundational texts of analytic philosophy. Additionally, they will hone their skills at analyzing philosophical arguments and at writing wellstructured philosophy essays.", "key_topics": "Analytic philosophy comprises a broad family of approaches to philosophical problems that emphasize the importance of clarity and rigor in argumentation, and whose characteristic feature is a practice of philosophical analysis that often draws upon, and is continuous with, both the formal and the empirical sciences. This course will introduce students to the methods and some of the foundational debates of this philosophical tradition. We will learn about the central role played by logical and conceptual analysis and by the study of language in analytic philosophy. Among the topics that we will discuss are the nature of meaning, the possibility of a prior knowledge, the analysis of truth, as well as inductive reasoning, confirmation, and probability.", "prerequisite_knowledge": "No prior knowledge required. Some acquaintance with formal logic would be beneficial.", "assessment_structure": "Short written assignments and a final paper.", "relevance": "Students will learn about some of the foundational questions and prominent positions in analytic philosophy, the dominant philosophical tradition in the English-speaking world. In doing so, students will get acquainted with an approach to philosophical inquiry that has not only shaped much of contemporary philosophy, but that has also influenced the development of disciplines such as logic, linguistics, computer science, and cognitive science.", "learning_resources": "Readings will consists of journal articles and book excerpts, all of which will be available in electronic form on Canvas.", "extra_time_commitment": null}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}