{"code": "80-316", "name": "Logic and AI", "base_name": "Logic and AI", "units": 9.0, "min_units": 9.0, "max_units": 9.0, "short_name": "LOGIC AND AI", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [{"semester": 2, "year": 2021}], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "In this course, we will study logical systems that are relevant to, and motivated by, research in artificial intelligence. We will see how key ideas and advances in logic have found and continue to find natural applications in AI. More generally, we will see how logic and AI can benefit, and historically have benefited, from each other. A central aim of this course is to understand how logical languages of varying expressive power can be put to use in AI as a tool for representation and reasoning. Some of the topics that we will be focusing on are 1 nonmonotonic and default logics, 2 modal logics for reasoning about knowledgebelief, temporal structures, and computation, 3 probabilistic logics and the relation between logic and probability, 4 logics of graphical causal models and counterfactuals, as well as 5 elements of probabilistic programming and computable probability theory.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "intermittent", "type": "INFO"}], "website": null, "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "repeat_limit_attempts": null, "repeat_limit_credits": null, "catalog_levels": [], "skills": [], "attributes": [{"name": "interdisciplinary", "id": 10, "type": "attribute"}, {"name": "research", "id": 14, "type": "attribute"}, {"name": "team project", "id": 17, "type": "attribute"}], "custom_fields": {"goals": "Students will get acquainted with various logical tools that can be leveraged for the study of artificial intelligenceincluding 1 nonmonotonic logics, 2 modal logics for reasoning about knowledgebelief, temporal structures, and computation, 3 probabilistic logics, 4 logics of graphical causal models and counterfactuals, as well as 5 elements of probabilistic programming and computable probability theory.", "key_topics": "In this course, we will study logical systems that are relevant to, and motivated by, research in artificial intelligence. We will see how key ideas and advances in logic have found (and continue to find) natural applications in AI. More generally, we will see how logic and AI can benefit, and historically have benefited from each other.", "prerequisite_knowledge": "A background in logic (as might be acquired by taking an intermediate-level course) is expected.", "assessment_structure": "Homework assignments, final project, final project presentation.", "relevance": "Students will learn about various applications of logic in artificial intelligence. We will discuss the central role of logic in the early development of AI, as well as the use of logical tools in more recent work in artificial intelligence.", "learning_resources": "Reading materials provided by the instructor.", "extra_time_commitment": null}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}