{"code": "82-215", "name": "Arab Culture Through Dialogues, Film, and Literature", "base_name": "Arab Culture Through Dialogues, Film, and Literature", "units": 9.0, "min_units": 9.0, "max_units": 9.0, "short_name": "ARB CLTR DLG FLM LIT", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [{"semester": 2, "year": 2022}, {"semester": 1, "year": 2022}, {"semester": 1, "year": 2023}, {"semester": 2, "year": 2024}, {"semester": 1, "year": 2024}], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "F23 Minorities in the Middle East and North Africa In todays society that explores Diversity, Equity, and Inclusion DEI, one ought to ponder if Arab societies have made progress to achieve DEI among groups of other religions Muslims, Christians, Jews, sects Sunni and Shia, ethnicities Copts, Nubians, Kurds, Palestinians, LGBTQ, and women. Some of the questions that this course addresses are whether a minority in Arab societies is defined by number or status the role of education, social norms, and media in approaching issues of skin colors and minorities rights the autocratic governments use of identity politics to serve their own interests and the historical changes that have shaped citizenship and belonging. This course aims to enrich students understanding of the diversity of Arab countries and the impact of colonialism, PanArabism, socioeconomy, and cultural norms on minorities status through readings, filmsdocumentaries, music, and data collected via surveys and virtual sessions with students in Arab countries.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "specific_sem", "type": "INFO", "sem": 1}, {"name": "specific_sem", "type": "INFO", "sem": 2}], "website": null, "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "repeat_limit_attempts": null, "repeat_limit_credits": null, "catalog_levels": [], "skills": [], "attributes": [{"name": "discussion intensive", "id": 2, "type": "attribute"}, {"name": "diversity", "id": 3, "type": "attribute"}, {"name": "for non-majors", "id": 6, "type": "attribute"}, {"name": "team project", "id": 17, "type": "attribute"}, {"name": "communication & presentation", "id": 19, "type": "attribute"}, {"name": "intercultural & global lrng", "id": 22, "type": "attribute"}, {"name": "equity & inclusion", "id": 23, "type": "attribute"}], "custom_fields": {"goals": "To challenge stereotypes, appreciate the diversity, and foster a better understanding of the social reality of Arab societies. To understand the complexity of using identity politics on shaping the status of minority groups and their sense of citizenship and belonging. To foster critical thinking when analyzing films, documentaries, and readings, and contextualize them in their short and long term historical, social, and cultural contexts.To increase students crosscultural literacy and intercultural competence and equip them to become global citizens in todays interconnected world by bridging American and Arab cultures through virtual meetings with Arab students in the SWANA.To analyze collected data from past and current survey questions in order to trace the intellectual development of Arab societies and their attitude towards minority issues.", "key_topics": "Orientalism and the Western perspective of the Arab World - Blackness - African and Arab refugees - regime use of identity politics - ethnic, religious, sectarian minorities - sexual and gender issues.", "prerequisite_knowledge": null, "assessment_structure": "Participation, online discussion forums, two short papers on films and readings, two short papers on novels, brief reports on virtual exchanges, and a final group project", "relevance": "DC: Contextual Thinking\n\nConsider why certain perceptions of minority groups and their identity issues were formed, in light of their socio-economic, cultural, and/or political milieu, and infer ways to improve the understanding of those issues through multi-faceted comparisons in order to appreciate those challenges in their respective societies.", "learning_resources": "Most resources are provided via Canvas, and students will need to purchase two inexpensive novels and occasionally rent a film online", "extra_time_commitment": null}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}