{"code": "99-250", "name": "Seminar for Peer Mentors", "base_name": "Seminar for Peer Mentors", "units": 1.0, "min_units": 1.0, "max_units": 1.0, "short_name": "SEMINAR PEER MENTOR", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1, 2], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [{"semester": 1, "year": 2022}, {"semester": 2, "year": 2023}, {"semester": 1, "year": 2023}, {"semester": 2, "year": 2024}, {"semester": 1, "year": 2024}], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "SPECIAL PERMISSION REQUIRED YES The purpose of this training course is to provide undergraduates with the knowledge, skills, and experience necessary to become effective Peer Tutors. Throughout the course, students will be exposed to the mission and goals of Academic Development and the Peer Tutoring Program. The class lasts approximately nine weeks and is generally offered in the spring term from February through April. The course explores the roles and responsibilities of the tutor while offering insights into effective tutoring strategies through interactive discussion and role plays. In addition, trainees work handson with experienced tutors to troubleshoot potential problems and situations. Students will gain experience in group dynamics, communication skills, study strategies, referral resources, leadership, and creating a supportive learning environment. Teaching practice is an integral part of the training program. Students must complete an application in person or electronically at httpswww.cmu.eduacadevjobsindex.html and then be interviewed by the instructors to determine if the student possesses the basic qualifications.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "specific_sem", "type": "INFO", "sem": 1}, {"name": "specific_sem", "type": "INFO", "sem": 2}], "website": "http://www.cmu.edu/acadev/studentjobs/", "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "repeat_limit_attempts": null, "repeat_limit_credits": null, "catalog_levels": [], "skills": [], "attributes": [], "custom_fields": {"goals": "Upon completion of this course, students should be able to1.Identify campus units and resources e.g., CaPS, Office of Disability Resources, etc. where they can direct students when needed.2.Recognize learning support services at the Student Academic Success Center and discuss when and how to refer students to these services.3.Reflect upon their own experiences as learners and consider how these experiences compare to those of other students.4.Demonstrate skills associated with their respective peer mentor positions e.g., implementing collaborative learning techniques.", "key_topics": "CMUS 99-250 Seminar in Peer Tutoring is a special-admittance class that is certified by the College Reading and Learning Association (CRLA) thru 2022. The course introduces the techniques and strategies that aspiring tutors and teachers can use to promote independent learning on the part of their students. We start from the roles and responsibilities of a Peer Tutor and progress to an enhanced understanding of the learning and teaching theory that inform Peer Tutoring and teaching in general.", "prerequisite_knowledge": "CMUS 99-250 is a special-admittance-only course. Students must fill out an on-line application and successfully complete the interview process to be enrolled in the course. Potential enrollees are required to have a minimum 3.5 cumulative GPA and an 'A' in any course they wish to tutor. Beyond these minimum qualifications, we seek individuals who have excellent communication, organizational, and time management skills.", "assessment_structure": "Attendance and active participation are paramount to successfully completing the course. This is a discussion-based class that relies on its attendees to share their experiences, questions, and concerns so that we can brainstorm solutions to some of the issues that occur with tutoring at Carnegie Mellon University. Students must also complete their practicum requirement to be successful in the course.", "relevance": "CMUS 99-250 Seminar in Peer Tutoring trains highly qualified undergraduate students to serve as Peer Tutors for both the university's introductory level math, science, and engineering courses as well as other classes across all departments and majors.", "learning_resources": "The instructor and experienced Peer Tutors are the primary learning resources for the course. The instructor will also provide access to a textbook and supplemental readings/handouts as the semester progresses.", "extra_time_commitment": null}, "grade_option": {"name": "Pass/Fail", "short_name": "P", "never_graded": false, "is_pass_fail": true, "is_audit": false, "id": 4}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}