{"code": "99-380", "name": "Transforming Cities: Cities and Social Justice", "base_name": "Transforming Cities: Cities and Social Justice", "units": 3.0, "min_units": 3.0, "max_units": 3.0, "short_name": "CITIES SOCIAL JUSTIC", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [{"semester": 1, "year": 2021}], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "Due to economic development and globalization, cities continue to grow with predictions that 70 of the worlds population will live in urban areas by the year 2050. This course, then, will view cities as hubs where patterns, connections, discussions, and the processes shape such issues as social justice, economic development, technology, migration, the environment among others. By examining cities as a lens, this sequence of weekend courses encourages students to examine cities as a system for discussing social processes being built and rebuilt. With an interdisciplinary focus, the course invites experts from the University of Pittsburgh, Carnegie Mellon, and relevant fields more broadly.  This iteration of the course will explore such topics as the rapid growth of cities and their impact on fair housing, gentrification, and poverty the role of human rights cities as models the role of migration on cities the role of governance addressing inequality the need to have access to health care among others.  Added Note The course will occur on Friday, October 22nd, Saturday, October 23rd, and Sunday, October 24th. Engagement in the course should be synchronous accommodations for those in significant time zone differences will be provided to allow enrollment and completion of all elements of the weekend.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "specific_sem", "type": "INFO", "sem": 1}], "website": null, "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "repeat_limit_attempts": null, "repeat_limit_credits": null, "catalog_levels": [], "skills": [], "attributes": [], "custom_fields": {"goals": "By the end of the course, students will be able toIdentify and define the characteristics of inclusive and just cities WorksheetsIdentify and compare dimensions of the benefits of inclusive, just cities and the harms of divided, inequitable cities WorksheetsCompare disciplinary approaches and perspectives on social justice and cities Comparison WorksheetEvaluate how select targets for Sustainable Development Goal 10 and 11 can inform city practices to improve on a citys performance in relation to a selected social justice issue Worksheets and Global City Analysis assignmentsUse key concepts articulated in the course to identify a global city to analyze its practices as they relate to select targets for SDGs 10 11 and provide recommendations as to how the city can become more inclusive and just Worksheets and Global City Analysis assignments.", "key_topics": "Cities, social justice, human rights cities, inequality", "prerequisite_knowledge": "None is necessary. The course is set up to allow easy entrance for any student interested in the topic broadly or narrowly.", "assessment_structure": "Pre- and Post-Course Surveys (10%)\nLecture and Activity Worksheets (48%)\nCity Analysis Paper Assignments (Planning and Final Document) (42%)", "relevance": "Lectures and activities highlight various interdisciplinary approaches and research related to cities and social justice. It provides insight from a variety of researchers and practitioners that students otherwise may not be in contact with.", "learning_resources": "Slides and readings from faculty participants, prior examples from students, assignment descriptions and rubrics will be on Canvas. The weekend will include case study activities and worksheets to aid in the learning of the concepts.", "extra_time_commitment": "Students will be expected to complete various assignments once the weekend is complete. A pre-course survey, viewing of a recorded lecture on the major assignment, and review of prior student examples for the major course assignment are required before the weekend course begins. Other commitments are comparable to a normal course with outside research and preparation of assignments after the weekend."}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}