{"code": "03-730", "name": "Advanced Genetics", "base_name": "Advanced Genetics", "units": 12.0, "min_units": 12.0, "max_units": 12.0, "short_name": "ADVANCED GENETICS", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [{"semester": 2, "year": 2020}, {"semester": 2, "year": 2021}, {"semester": 2, "year": 2022}, {"semester": 2, "year": 2023}, {"semester": 2, "year": 2024}], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "This course considers selected current topics in molecular genetics at an advanced level. Emphasis is on classroom discussion of research papers. Topics are subject to change yearly. Examples of past topics include nucleocytoplasmic trafficking of RNA in yeast, genome imprinting in mammals, molecular genetics of learning and memory in Drosophila, viral genomics, using yeast as a model system to study the molecular basis of human neurodegenerative diseases, and CRISPRCas9 genome editing.", "student_sets": [{"id": 895, "name": "graduate"}], "offering_tags": [{"name": "specific_sem", "type": "INFO", "sem": 2}], "website": null, "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "repeat_limit_attempts": null, "repeat_limit_credits": null, "catalog_levels": [], "skills": [{"name": "Genetics", "slug": "genetics", "id": 169}], "attributes": [{"name": "discussion intensive", "id": 2, "type": "attribute"}, {"name": "interdisciplinary", "id": 10, "type": "attribute"}, {"name": "reading intensive", "id": 13, "type": "attribute"}, {"name": "writing intensive", "id": 18, "type": "attribute"}, {"name": "communication & presentation", "id": 19, "type": "attribute"}, {"name": "information & data literacy", "id": 20, "type": "attribute"}, {"name": "collaboration & teamwork", "id": 21, "type": "attribute"}], "custom_fields": {"goals": "Learn how one can identify important problems, which ones can be solved with existing tools of molecular genetics and genomics, how one develops new genetic tools as needed, and how to solve the problems with creative thinking.Describe the fundamental aspects of genome editing and discuss the major ways in which the technology has been appliedDiscuss the use of genome editing principles to new biomedical problems and identify significant recent research reported in peerreviewed literature", "key_topics": "In the first half of this course, we will discuss examples of creative problem solving, using model organisms, including the simple eukaryote Saccharomyces cerevisiae, to investigate the molecular basis of neurodegenerative diseases in humans. We will strive to understand genetic principles underlying the contemporary genomic approaches to identify and characterize biological pathways dysfunctional in these diseases. In the second half of this course, we will explore the fundamental biological mechanisms of genome editing and the CRISPR system. We will also discuss technical issues that arise in use of this technology and how researchers are attempting to improve the technology. Additionally, applications of this technology to disease modeling, germ-line engineering, cell-based engineering, and disease therapy will be explored.", "prerequisite_knowledge": "Background course work in biology, molecular genetics, and biochemistry", "assessment_structure": "Weekly homework assignments on associated readings, about 3 quizzes, and a mini project in the second half of the course. A significant portion of the grade will come from class attendance and participation in small and large group discussions about the assigned readings.", "relevance": "Students will gain fundamental knowledge of contemporary genomics and genetic approaches to understand molecules dysfunctional in human diseases. Second, students will gain knowledge of genome editing techniques, the current research being conducted in the field, as well as applications of the technologies.", "learning_resources": "Students will be assigned multiple papers that will be discussed during class", "extra_time_commitment": "A large amount of the time will be spent outside of class reading the assigned weekly papers and answering associated homework questions in preparation for the class discussions each week."}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}