{"code": "33-151", "name": "Matter and Interactions I", "base_name": "Matter and Interactions I", "units": 12.0, "min_units": 12.0, "max_units": 12.0, "short_name": "MATTR & INTERACTNS 1", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [{"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}, {"semester": 1, "year": 2023}, {"semester": 1, "year": 2024}], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [{"code": "21-122", "id": 2628, "name": "Integration and Approximation", "units": 10.0}], "anti_reqs": [], "equiv": [], "long_desc": "For students with a strong physics background who are interested in using calculusbased mechanics to learn about topics such as dark matter, particle physics, and quantum phenomena, Matter and Interactions I provides an excellent alternative to Physics for Science Students. This course places great emphasis on constructing and using physical models, with a special focus on computer modeling to solve problems. Throughout the course, both traditional analytics techniques and scientific computing will be used to solve mechanical problems going from planetary systems, springbased systems and nuclear scattering. Topics covered include Newtons Laws, microscopic models of solids, energy, energy quantization, massenergy equivalence, multi particle systems, collisions, angular momentum including quantized angular momentum, kinetic theory of gases and statistical mechanics. Students conduct team research projects that will be presented at a departmental poster session at the end of the semester. This course has a corequisite of 21122.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "specific_sem", "type": "INFO", "sem": 1}], "website": null, "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "repeat_limit_attempts": null, "repeat_limit_credits": null, "catalog_levels": [], "skills": [], "attributes": [], "custom_fields": {"goals": "Learn how to work like a scientist as part of a team to solve problems. This includes both traditional pencil and paper as well as computational techniques. In addition, the students will learn how to present a team project in a poster format.", "key_topics": "This course covers material normal in a first-semester physics course with and emphasis on mechanics and thermodynamics. However, the course is taught at a more advanced level relying heavily on momentum, energy and angular momentum. The course also introduces advanced topics such as particle physics, dark matter, solid-state physics, scattering and statistical mechanics.", "prerequisite_knowledge": "Knowledge of calculus is required, previous experience with physics is strongly recommended. Students must have completed 21-120.", "assessment_structure": "Three in-class midterm exams and a final exam, a group project, weekly assignments both in traditional problem solving and computing and regular short quizzes. Attendance and participation also factor into the overall assessment.", "relevance": "This course builds on a solid high school physics background and delves into many topics that would normally not be touched until more advanced courses. It serves as a foundational prerequisite for most advanced physics courses.", "learning_resources": "Textbook, and material available on Canvas.", "extra_time_commitment": "The project poster session is scheduled in the early evening of the last week of classes and is required as part of the project."}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}