{"code": "70-354", "name": "Communication: Social Media in Action", "base_name": "Communication: Social Media in Action", "units": 6.0, "min_units": 6.0, "max_units": 6.0, "short_name": "COMM SOCIAL MEDIA", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [{"semester": 1, "year": 2021}, {"semester": 1, "year": 2022}, {"semester": 1, "year": 2023}], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "Building upon what you already learned in Business Communications, this course will amplify your ability to successfully work in teams to produce social media content, collaborate via online mediums, and build online communication skills through development of an effective online presence. You will create and deliver social media content for your chosen organizations in this online space. This is a differentiator for you after this course, you will be able to go into an interview confidently and share your team experience helping the organization build a successful social media presence. This course may use thirdparty course material that is not available for individual purchase from the publisher. If so, the thirdparty course material will be secured and provided by the Tepper School to students enrolled in the course, and students enrolled in the course will be required to pay to the University the associated additional course materials fee for the thirdparty course material provided.   The amount of the course materials fee is dependent on the Universitys cost of the particular materials provided, and typically ranges from 13 to 75.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "intermittent", "type": "INFO"}], "website": null, "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "repeat_limit_attempts": null, "repeat_limit_credits": null, "catalog_levels": [], "skills": [], "attributes": [{"name": "communication & presentation", "id": 19, "type": "attribute"}], "custom_fields": {"goals": "Produce social media content, collaborate via online mediums, and build online communication skills through development of an effective online presence.", "key_topics": "Explore factors that help audience decision-making;\nDiscover how social media and mass communication differs from all other forms of communication;\nResearch organizational needs and create an appropriate social media platform;\nWrite blog/vlog posts;\nProduce podcast episodes;\nCreate social media content for FB, Twitter, or IG\nUse an entrepreneurial perspective to research and create social media platforms for selected organizations;\nAnalyze media and the truthfulness behind it;\nCommunicate effectively with internal and external clients and partners;\nDevelop remote teams and leadership (weekly team meetings and in-class feedback);\nCreate professional online presence (online resumes and virtual interviewing)", "prerequisite_knowledge": "Business communication skills competency from Business Communication (or related approved course) in audience analysis, adapting written, oral, and visual messages to diverse business or professional audiences, industry-focused research, persuasion, and ethical, responsible interpersonal communication skills.", "assessment_structure": "Graded assignments include team social media deliverables (blog/vlog, podcast, social media platform), team presentations, and peer-and self-assessments.", "relevance": "This course amplifies your ability to successfully work in teams to produce social media content, collaborate via online mediums, and build online communication skills through development of an effective online presence. Employees who communicate clearly, effectively, and can develop relationships with internal and external clients both in-person and online will thrive in these online environments. This course leads you through the development of creating effective social media platforms for your own team's organization.", "learning_resources": "Team and team/instructor meetings, possibly adding 1 hour to the expected weekly hours", "extra_time_commitment": "Course page in Canvas contains all resource"}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}