{"code": "70-353", "name": "Financial Regulation in the Digital Age", "base_name": "Financial Regulation in the Digital Age", "units": 9.0, "min_units": 9.0, "max_units": 9.0, "short_name": "FIN REG IN DIGTL AGE", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [{"semester": 2, "year": 2016}, {"semester": 2, "year": 2017}, {"semester": 2, "year": 2020}, {"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "The course will address the foundations of regulation why regulate from various perspectives within the context of a market economy, highlighting the sources of market failure such as externalities, adverse selection, and natural monopoly and potential remedies such as taxes and fees, disclosure, price regulation, guarantees. The conflicting goals among regulators and why we have multiple regulators and their impact on the meaning of regulation will be considered along with regulatory competitionarbitrage. Portions of the course will tackle relatively broad questions such as Why regulate What is the law of unintended consequences What is the objective of a policy advocate Are regulators and regulatory policies a systemic risk Are our markets rigged How can regulators enhance the predictability and credibility of their policies How costly were government guarantees during the financial crisis Should we bar insider trading Should regulations be determined and motivated based upon costbenefit analysis How can we evaluate the success or failure of particular regulations and whether they have achieved their objectives How does the DoddFrank Act promote financial stability What basic aspects of the financial crisis did DoddFrank not address Lecture, 3 hours. Minimum grade standard of C applies only to economics courses. This course may use thirdparty course material that is not available for individual purchase from the publisher.   If so, the thirdparty course material will be secured and provided by the Tepper School to students enrolled in the course, and students enrolled in the course will be required to pay to the University the associated additional course materials fee for the thirdparty course material provided.   The amount of the course materials fee is dependent on the Universitys cost of the particular materials provided, and typically ranges from 13 to 75.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "intermittent", "type": "INFO"}], "website": null, "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "repeat_limit_attempts": null, "repeat_limit_credits": null, "catalog_levels": [], "skills": [{"name": "Financial Analysis", "slug": "financial-analysis", "id": 1858}, {"name": "Tax System", "slug": "tax-system", "id": 1865}], "attributes": [{"name": "discussion intensive", "id": 2, "type": "attribute"}, {"name": "ethics", "id": 5, "type": "attribute"}], "custom_fields": {"goals": null, "key_topics": "Electronic trading; blockchain/cyber technology; initial public offerings; ownership of data; algorithms (ethics/fairness and use of conditioning variables, antitrust, privacy); foundation of regulation and financial regulation.", "prerequisite_knowledge": "Intermediate-level microeconomic analysis and multi-variate calculus", "assessment_structure": null, "relevance": "This course for those students interested in working in financial and digital markets, with an investigation of how government policy affects these markets.", "learning_resources": "Weekly office hours, lecture slides, lecture notes, and articles/texts (made available on the course Canvas page).", "extra_time_commitment": null}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}