{"code": "70-389", "name": "Design Thinking for Business: Creative Solutions for Complex Problems", "base_name": "Design Thinking for Business: Creative Solutions for Complex Problems", "units": 9.0, "min_units": 9.0, "max_units": 9.0, "short_name": "DESIGN THINKING", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [{"semester": 2, "year": 2024}], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "In todays rapidly evolving world, businesses constantly seek innovative solutions to complex problems. Design Thinking has emerged as a powerful process to address these challenges by fostering creativity, empathy, experience, and collaboration. This course introduces the principles, methods, and tools of Design Thinking and explores an array of techniques and frameworksfrom problem framing and creative ideation to prototyping and user testing. We will adopt the UN Sustainable Development Goals to bring positive changes to people and the planet and shape a more prosperous future for all.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "intermittent", "type": "INFO"}], "website": null, "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "repeat_limit_attempts": null, "repeat_limit_credits": null, "catalog_levels": [], "skills": [], "attributes": [], "custom_fields": {"goals": "By the end of this course, students will be able to Master the Design Thinking process Gain a comprehensive understanding of the steps and principles involved in Design Thinking. Foster creativity and innovation Develop the skills and mindset to think creatively and generate innovative ideas. Embrace a usercentered approach Cultivate empathy and learn techniques to understand user needs and preferences. Enhance collaboration and teamwork Improve the ability to work effectively in teams and leverage diverse perspectives. Apply Design Thinking to business challenges Use Design Thinking methods to solve realworld problems in a business context.", "key_topics": "¿ Introduction to Design Thinking: Overview of the design thinking process,\nemphasizing empathy and collaboration.\n¿ User-Centered Design: Conducting user research, developing personas, and\nunderstanding user needs.\n¿ UN Sustainable Development Goals: Explore a values-led framework for\nsustainable innovation.\n¿ Leverage design tools like Figma to enhance the Design Thinking journey.\n¿ Ideation and Prototyping: Generating creative ideas and creating low-fidelity\nprototypes.\n¿ Human-Centered Problem Solving: Applying design thinking to solve complex\nproblems and refine solutions based on user feedback.\n¿ Design Thinking in Business: Exploring the role of design thinking in driving\ninnovation and customer-centric strategies", "prerequisite_knowledge": "This course is open to individuals from diverse backgrounds and does not require prior Design Thinking knowledge or experience. All that is needed is a curious mind and a willingness to embrace new ways of problem-solving.", "assessment_structure": "This Design thinking course will incorporate project-based learning to provide students with hands-on experience in applying design thinking principles to real-world challenges. The projects are designed to foster critical thinking, problem-solving, collaboration, and creativity.\n\nThere are two assessed projects in this course. Grades from both are aggregated, factoring in their respective percentage weightings, to establish an overall grade for the course.\n\nProject 1 - Design Thinking: A Creative Process for Tackling Complex Problems\nStudents work in teams using Design Thinking to tackle a social or environmental problem. They conduct design research to understand the needs of the target community, ideate innovative solutions, develop prototypes, and test ideas with the end-users or peers. The result is a creative and inspiring project to create positive social and/or ecological impacts. Final projects are presented in class at the end of the course, with Q&A from faculty and peers.\n\nProject 2 - Design Thinking Journal: A Journey of Insights\nStudents develop a reflective journal in Figma to document their learning journey, ongoing critical reflections, and insights as they emerge through the course. All journals will be shared at the end of the course with faculty and student peers.", "relevance": "Design is the process of turning existing situations into preferred ones. Design Thinking, therefore, accelerates this change-making process through a powerful repertoire of creative tools, innovative methods, and designerly tactics. Through inspiring lectures, theoretical readings, and practical design challenges, students learn to harness the power of Design Thinking, and use it as an essential tool for tackling complex problems.", "learning_resources": "Learning resources for this course will comprise an inspirational collection of design-related videos, podcasts, websites, and articles. Readings will be scanned and made available to all enrolled students by the start of the Spring semester.", "extra_time_commitment": "Students are expected to conduct approximately 4-hours of study outside of scheduled class times each week."}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}