{"code": "76-107", "name": "Writing about Data", "base_name": "Writing about Data", "units": 4.5, "min_units": 4.5, "max_units": 4.5, "short_name": "WRTG ABOUT DATA", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [{"semester": 2, "year": 2023}, {"semester": 3, "year": 2023}, {"semester": 1, "year": 2023}, {"semester": 2, "year": 2024}, {"semester": 1, "year": 2024}], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [{"code": "76-102", "id": 4567, "name": "Advanced First Year Writing: Special Topics", "units": 9.0}, {"code": "76-101", "id": 4568, "name": "Interpretation and Argument", "units": 9.0}], "long_desc": "Our lives are increasingly shaped by writing that involves numbers newspapers routinely report the latest medical fads politicians support their political agendas with both dubious and credible statistics parents use data to decide where to buy a house and where to send their kids to school. This course one of two minis students can choose to fulfill their FYW requirement focuses upon interpreting and making arguments using mainly numerical data but also qualitative data. We will look at research in a range of disciplinesincluding psychology, education, medicine, engineering, and the sciencesand note how writers select and analyze the data they collect. We will also examine what happens to this research when it is picked up by the popular media. Students will also practice collecting and analyzing their own data and reporting it to suit the needs of various stakeholders. There are two primary audiences for this section. Students in datadriven majors will find the section useful preparation for communicating in their disciplines. Students in other fields will learn how to critique and respond to the many ways that numbers shape our lives. This section presumes a basic ability to calculate averages, percentages, and ratios, but no advanced mathematical or statistical preparation. Instead, this section provides a fascinating look at how numbers and words intersect to create persuasive arguments in academic, professional, and popular contexts. Students will compare and analyze texts that make arguments with data, practice rhetorical strategies for synthesizing and representing data so that by the end of the class, students will apply these strategies to write an original datadriven research proposal.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "specific_sem", "type": "INFO", "sem": 1}, {"name": "specific_sem", "type": "INFO", "sem": 2}], "website": "https://www.cmu.edu/dietrich/english/academic-programs/writing-and-communication/index.html", "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "repeat_limit_attempts": null, "repeat_limit_credits": null, "catalog_levels": [], "skills": [{"name": "Picking", "slug": "picking", "id": 1948}], "attributes": [{"name": "discussion intensive", "id": 2, "type": "attribute"}, {"name": "reading intensive", "id": 13, "type": "attribute"}, {"name": "writing intensive", "id": 18, "type": "attribute"}, {"name": "communication & presentation", "id": 19, "type": "attribute"}, {"name": "information & data literacy", "id": 20, "type": "attribute"}, {"name": "collaboration & teamwork", "id": 21, "type": "attribute"}], "custom_fields": {"goals": "In 76107, you will learn toAnalyze arguments made with dataProduce effective data visualizations and interpret them for a range of audiencesWrite a datadriven technical reportIntroduce and propose a datadriven study by synthesizing previous research", "key_topics": "academic writing, data-driven argument, synthesis, technical report, data visualization and caption writing, IMRD genre, IMRD Literature Review and Proposal", "prerequisite_knowledge": "Students should be able to work comfortably with summary, paraphrase and basic citation methods to support source-based writing; should be familiar with basic argument skills for both reading and writing; should exercise control over language choices and should exercise control over composition processes; should be familiar with a variety of strategies for planning and writing texts.", "assessment_structure": "Comparative Genre Analysis (IMRD report)\nLiterature review & Proposal\nDaily Classwork, homework, and quizzes", "relevance": "76-107 is one of three First-Year Writing mini (half-semester) courses, along with 76-106 and 76-108. Taking two out of these three minis is one of the course options that students can choose to fulfill their First-Year Writing requirement. The other option is to take a full-semester course, normally 76-101. If you like the idea of a fresh start in the middle of the semester, taking two mini courses might be a good option for you. The minis offer students the opportunity to focus upon strategies for particular types of communication situations and target genres. By taking two minis, you will gain exposure to more than one kind of writing: arts & humanities-based (76-106), technical (76-107), and professional (76-108). You will also learn ways of adapting to new and different communication situations. Some students report a more dynamic structure and pace driven by the break at mid-semester.", "learning_resources": "materials available through Canvas", "extra_time_commitment": "1:1 conferences with faculty about your writing"}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}