{"code": "76-219", "name": "Law & Blame", "base_name": "Law & Blame", "units": 9.0, "min_units": 9.0, "max_units": 9.0, "short_name": "LAW & BLAME", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [{"semester": 2, "year": 2021}, {"semester": 2, "year": 2023}], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "How do we use language to accuse and defend How do we attribute responsibility to specific individuals or institutions and dispute such claims, either by debunking them or shifting the blame What makes the stories we tell and the arguments we make about responsibility succeed or fail What unintended consequences can they produce and for what groups This course will examine these and related questions through the lens of legal cases in which individuals or institutions are accused of responsibility for harm, from vehicular accident cases to criminal trials. The study of these questions is not only valuable for understanding the legal process, participating in it, or writing about it, but the practice of attributing responsibility is common in many social and institutional contexts beyond law, even in daily conversation. The course explores fundamental questions about culture, ethics, and politics, including issues involving systematic and structural inequalities involving race, class, gender, sexual orientation, religion, and national origin, which are evident both in the legal cases studied and in the public imagination and controversy beyond the courtroom. The societal implications explored include inequitable constraints on freedom in criminal justice and economic inequalities perpetuated through civil lawsuits, as well as inequalities in cultural power and status in the ways some voices are recognized in the legal process and others are not. Drawing on readings from rhetoric, linguistics, and legal studies, as well as briefs, opening and closing arguments, direct and crossexaminations of witnesses, physical and documentary evidence, and judicial opinions from legal cases, we will examine the strategies advocates use to attribute responsibility, enhance equity, and manage such disputes.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "intermittent", "type": "INFO"}], "website": null, "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "repeat_limit_attempts": null, "repeat_limit_credits": null, "catalog_levels": [], "skills": [], "attributes": [{"name": "discussion intensive", "id": 2, "type": "attribute"}, {"name": "ethics", "id": 5, "type": "attribute"}, {"name": "interdisciplinary", "id": 10, "type": "attribute"}, {"name": "reading intensive", "id": 13, "type": "attribute"}, {"name": "writing intensive", "id": 18, "type": "attribute"}, {"name": "communication & presentation", "id": 19, "type": "attribute"}], "custom_fields": {"goals": "The course is designed as a combined seminar and workshop in the production of arguments attributing responsibility for harm. By the end of the semester, students will be able toIdentify, evaluate, and apply common topics of debate regarding attributions of responsibility for harmful actionsAssess the rhetorical, historical, cultural, ethical, and philosophical dimensions of attributions of responsibilityCompare and contrast the strengths and limitations of the various disciplinary perspectives along with their implications and consequencesAnalyze the impact of systematic and structural inequalities involving race, class, gender, sexual orientation, religion, and national origin on the prosecution and outcome of casesDevelop and support rhetorical analyses of attributions of responsibility in specific casesDevelop and support an argument advocating or disputing responsibility for harm in a specific caseRead texts for detail and anomaly, attending closely to both the denotative and connotative meanings of language andOrganize data into appropriate frameworks for interpretation.", "key_topics": "The rhetorical strategies used to attribute responsibility to specific individuals or institutions or dispute such claims, examined through the lens of legal cases and how the legal system manages such disputes. Examples may include the Boston Marathon bombing case, the Lindbergh kidnapping, Patty Hearst, O.J. Simpson, etc.", "prerequisite_knowledge": null, "assessment_structure": "Students will engage in class discussion, produce written responses to readings, reply to other students, and deliver two oral presentations. Students will write one short paper analyzing a claim of responsibility and one short paper advocating or disputing responsibility in a specific case, along with a final project that combines analysis with a recommended approach to advocacy.", "relevance": "Dietrich GenEd prior to Fall 2021: Communicating\nDietrich GenEd after Fall 2021: Equity and Justice\n\nThe course is not only valuable for understanding the legal process, participating in it, or writing about it, but the practice of attributing responsibility is common in many social and institutional contexts beyond law, even in daily conversation. The course asks fundamental questions about culture, ethics, and politics surrounding accountability issues and studies basic principles of rhetoric, linguistics, and writing about past events in many contexts.", "learning_resources": "All assigned readings for the course are electronically available on Canvas and in Perusall, which is available through Canvas.\nOptional reference materials are available in Hunt Library, with most held as reference works unavailable for check out from the library so they should always be on the shelf when not in use.", "extra_time_commitment": null}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}