{"code": "82-119", "name": "Arabic Calligraphy Culture & Skills", "base_name": "Arabic Calligraphy Culture & Skills", "units": 9.0, "min_units": 9.0, "max_units": 9.0, "short_name": "ARABIC CALL CLTR SK", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [{"semester": 1, "year": 2022}, {"semester": 2, "year": 2023}, {"semester": 1, "year": 2023}, {"semester": 2, "year": 2024}, {"semester": 1, "year": 2024}], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "This course introduces its participants to historical and cultural contexts and various techniques used to produce Arabic calligraphy works.  No previous knowledge of the Arabic script or language is necessary.  At the end of the course, participants will demonstrate familiarity and comfort with key movements in the history and art of Arabic calligraphy, and read simple alphabet constructions or words in a variety of styles.  Participants will apply proper techniques to producing calligraphy in two of the most commonly used styles, Naskh and Riqah, as well as experiment with some modern script styles. The class will use lecture discussions, audiovisual media, projects, guest speakers, and field trips as occasions arise.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "specific_sem", "type": "INFO", "sem": 1}, {"name": "specific_sem", "type": "INFO", "sem": 2}], "website": null, "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "repeat_limit_attempts": null, "repeat_limit_credits": null, "catalog_levels": [], "skills": [{"name": "Modern History", "slug": "modern-history", "id": 1266}, {"name": "Audio", "slug": "audio", "id": 1628}], "attributes": [{"name": "communication & presentation", "id": 19, "type": "attribute"}, {"name": "information & data literacy", "id": 20, "type": "attribute"}], "custom_fields": {"goals": null, "key_topics": "(see course description)", "prerequisite_knowledge": null, "assessment_structure": "¿\tWeekly Practice Modules: These \"Did I get it?\" modules are based on readings of assigned texts or audio-visual materials. They are no-stakes opportunity to test their acquired knowledge.\n¿\tWeekly Discussions modules: students are asked to respond to a question about Arabic calligraphy based on learning outcomes for that week. These are low stakes opportunities to participate and provide critical thinking focused on learned materials.\n¿\tAssignments: These are weekly writing tasks to allow them the opportunity to practice their calligraphy skills. They are given the opportunity to work on their assignment in class for real-time feedback.\n¿\tMidterm: This is an exam that covers learned materials, including writing skills, for the first half of the semester.\n¿\tFinal Project: This is a capstone product where students have the opportunity to be creative and use their learned skills and knowledge of Arabic calligraphy to produce an artistic expression in formats and forms that vary by semester.", "relevance": "For students who prefer to explore before they commit to learning Arabic, this course is an excellent opportunity to do just that. The course introduces the writing system in an artistic context that allows for the discovery of cultural connections. Senior students may not have had the opportunity to learn much about Arabic or Arab culture but will find the focus on artistic expressions of Arabic a welcome ending to their time at Carnegie Mellon. The course will help those enrolled, including our cultural heritage students, see the Arabic alphabet and Arabic culture from a different perspective. This course is an opportunity to see Arabic in a broader context and from a rarely explored perspective: Visual Expression.", "learning_resources": "Students use chapters of textbooks, a collection of articles, videos, VR site visits, and manuscript collections in print and online.", "extra_time_commitment": "Outside of a few class readings, videos, completing \"did I get it\" practices, and discussions, a minimum of 1 hour and a maximum of four hours of calligraphy practice outside are expected. Students are given the opportunity to use class time for practice purposes as well as a part of these extra time or in addition to it. The level of practice is crucial to the quality of calligraphy produced in class."}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}