{"code": "82-299", "name": "Equity & Justice in Modern Languages", "base_name": "Equity & Justice in Modern Languages", "units": 9.0, "min_units": 9.0, "max_units": 9.0, "short_name": "EQUITY & JUSTICE ML", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [{"semester": 2, "year": 2023}], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "S23 This course has the dual purpose of examining important human rights issues in Latin America and questioning the role of film in making visible, critiquing, or even sustaining the structures that lead to human rights violations. We will study specific human rights issues tackled by filmmakers in Latin America, such as cultural rights, gender and sexuality rights, economic rights, environmental issues, and war and state terror. Furthermore, we will discuss specific film schools and movements that developed to address human rights and social justice issues in diverse Latin American contexts. Finally, we will look at how Latin American films work the international human rights film festival circuit, and the ethical and practical implications of filming local human rights issues for international audiences. All coursework for this section in English. Students interested in doing coursework in Spanish for Hispanic Studies credit should register under 82399.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "intermittent", "type": "INFO"}], "website": null, "instructors": [], "is_repeatable": true, "is_req_repeatable": true, "repeat_limit_attempts": null, "repeat_limit_credits": null, "catalog_levels": [], "skills": [], "attributes": [{"name": "discussion intensive", "id": 2, "type": "attribute"}, {"name": "diversity", "id": 3, "type": "attribute"}, {"name": "for non-majors", "id": 6, "type": "attribute"}, {"name": "interdisciplinary", "id": 10, "type": "attribute"}, {"name": "communication & presentation", "id": 19, "type": "attribute"}, {"name": "intercultural & global lrng", "id": 22, "type": "attribute"}, {"name": "equity & inclusion", "id": 23, "type": "attribute"}], "custom_fields": {"goals": "1.\nUsing evidence and considering multiple perspectives, students will be able to articulate and discuss some of the major human rights issues, with corresponding key events and actors, in Latin American history and present times.2.\nStudents will be able to examine these issues as not isolated incidents endemic to a particular culture but as part of interconnected, global systems of inequity and injustice based on race, ethnicity, class, gender, sexuality and cultural identity.3.\nStudents will be able to explain and apply current human rights theoretical frameworks and analytical tools necessary for viewing film through diverse critical lenses.4.\nStudents will identify, explore, and challenge common stereotypes about Latin American peoples and cultures, often used to justify policies and practices leading to systemic inequity and injustice, as presented through media such as film.5.\nStudents will be able to articulate the ethics and consequencespros and consof film as a medium for sharing and discussing local human rights issues with a global audience.", "key_topics": "Latin American human rights, cultural rights, gender&sexuality rights, environmental rights, rights of immigrants; film as medium for discussing rights issues", "prerequisite_knowledge": null, "assessment_structure": "classwork and participation; viewing journal; 3 short essays; one presentation in pairs; final culminating written project", "relevance": "DC: Equity and Justice\n\nThis course will be of particular relevance to students interested in human rights issues, Hispanic Studies, Global Studies, and Film Studies.\n\nFor students with advanced proficiency in Spanish, coursework (writing, some reading, film viewing) may be done in Spanish for additional practice and possibly elective credit towards the Hispanic Studies major or minor.", "learning_resources": "Canvas, plus one required textbook: Cardenas, Human Rights in Latin America", "extra_time_commitment": null}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}