{"code": "84-310", "name": "International Political Economy", "base_name": "International Political Economy", "units": 9.0, "min_units": 9.0, "max_units": 9.0, "short_name": "INT POLITICAL ECON", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [{"semester": 1, "year": 2015}, {"semester": 1, "year": 2018}, {"semester": 1, "year": 2019}, {"semester": 1, "year": 2020}, {"semester": 1, "year": 2021}], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "This course explores how political institutions, processes, and actors influence economic interactions both domestically and internationally. During the semester, we will address two key questions 1 how do governments collaborate to regulate, and stabilize, the transboundary flow of capital, goods, and services 2 what are the distributional and political consequences of the current world economic order In exploring these questions from diverse theoretical lenses, we will discuss topics ranging from monetary and exchange rate policies, international trade, and global integration of production to the role of multinational corporations, social movements and civil society organizations, as well as institutions for corporate social responsibility, in the global economy. By the end of the course, students will be prepared to compare and contrast the theoretical propositions, and policy recommendations, of rival schools of thought.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "specific_sem", "type": "INFO", "sem": 1}], "website": null, "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "repeat_limit_attempts": null, "repeat_limit_credits": null, "catalog_levels": [], "skills": [{"name": "Economy", "slug": "economy", "id": 1841}], "attributes": [{"name": "discussion intensive", "id": 2, "type": "attribute"}, {"name": "interdisciplinary", "id": 10, "type": "attribute"}, {"name": "team project", "id": 17, "type": "attribute"}, {"name": "intercultural & global lrng", "id": 22, "type": "attribute"}], "custom_fields": {"goals": "Students will understand global economic history from 1900 to present, understand key economic arguments surrounding issues of economic integration, and understand the role of important institutions such as central banks and the WTO. The course will also advance students research skills and knowledge of modern statistical approaches.", "key_topics": "The course will cover international economics and the politics surrounding the design of the economic policies of states. It will emphasize the economic rationale and highlight the key winners and losers of international economic exchange.", "prerequisite_knowledge": "Any background in economics would be helpful. Prerequisite of Foundations of Political Economy or Principles of Microeconomics.", "assessment_structure": "There will be daily readings, quizzes, midterm and final exam, group research presentation, and individual student papers. In-class discussion will be a critical part of the course.", "relevance": "It is arguable that most prominent global issues are in some way related to economic issues, and as such internationally or economically oriented students who comprise CMU's student population will benefit from the content of the course.", "learning_resources": "The course will rely principally on two texts, Oatley's \"International Political Economy\" and Frieden et al.'s \"International Political Economy: Global Perspectives on Power and Wealth. I will provide PDF files of a number of academic articles for additional reading.", "extra_time_commitment": "Some level of coordination among students will be necessary outside of class for a group research project."}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}