{"code": "84-355", "name": "Democracy's Data: Analytics and Insights into American Elections", "base_name": "Democracy's Data: Analytics and Insights into American Elections", "units": 9.0, "min_units": 9.0, "max_units": 9.0, "short_name": "US ELECTIONS & DATA", "is_topic": false, "topic": null, "prereqs": {"text": "36-200 [] at least D", "req_obj": {"id": 7947222, "screen_name": "kv35mtermz72mx3", "original_min_units": null, "min_units": null, "is_shared": false, "is_uni_req": false, "is_concentration": false, "default_concentration": false, "choices": [{"id": 606, "screen_name": "36-200", "constraints": [{"type": "course", "type_string": "", "data": {"course": {"code": "36-200", "id": 605, "name": "Reasoning with Data", "units": 9.0}}, "id": 605, "is_hidden": false}], "course_parent_id": "79472220000000000606"}], "constraints": [{"type": "anyxof", "type_string": "Fulfill all of the following requirements", "data": {"x": 1, "is_and": true}, "id": 11003470, "is_hidden": false}, {"type": "mingrade", "type_string": "Minimum grade of D", "data": {"grade": "D", "only_transfer_status": false, "only_non_transfer_status": false}, "id": 11003471, "is_hidden": false}]}, "raw_pre_req": ""}, "offered_in_campuses": [1], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [{"semester": 1, "year": 2024}], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "This course offers a unique blend of political science and data analytics, focusing on the American electoral process with a special emphasis on contemporary elections. This course bridges historical electoral outcomes with current political events, highlighting how understanding past elections is key to interpreting the dynamics of present and future elections. This course recognizes a common observation people often view the next election as the most consequential. However, history tells us that the impact of elections can be profound and longlasting. From the pivotal election of 1876, which ended Reconstruction and reshaped the country for a century, to the razorthin margins in the 1960 Kennedy election and the 2000 BushGore contest, American politics have been deeply influenced by electoral outcomes.  Throughout the semester, students will delve into data analytics foundational concepts, focusing on data collection, statistical analysis, and interpretation. These techniques are applied to contemporary election trends, voter behavior, and political campaigning. The course uses historical elections as case studies to illustrate how past events and trends can shed light on current electoral phenomena.  The curriculum emphasizes the significance of historical context in shaping our understanding of todays elections. Students will explore how factors such as changing voter demographics, technological advancements in campaigning, and shifts in political ideologies have evolved over time and what they mean for current and future electoral strategies and outcomes.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "specific_sem", "type": "INFO", "sem": 1}], "website": null, "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "repeat_limit_attempts": null, "repeat_limit_credits": null, "catalog_levels": [], "skills": [], "attributes": [{"name": "discussion intensive", "id": 2, "type": "attribute"}, {"name": "ethics", "id": 5, "type": "attribute"}, {"name": "for non-majors", "id": 6, "type": "attribute"}, {"name": "interdisciplinary", "id": 10, "type": "attribute"}, {"name": "information & data literacy", "id": 20, "type": "attribute"}], "custom_fields": {"goals": "By the end of the course, students will be able to frame questions related to American elections, such as how do candidates emerge, why do some candidates succeed while others fail, when do elections fundamentally change the course of history, and who votes and why Students will be able to utilize diverse electoral data sources to analyze trends and patterns in American electoral behavior and outcomes. Using that data, students will be able to make connections between and across elections across the last several decades to explain how they have led to recent electoral outcomes. Students will be asked to reflect critically on personal perspectives regarding American elections in light of historical, cultural, and political contexts.", "key_topics": "The course will look at historical and contemporary political elections in the United States.", "prerequisite_knowledge": "36-200 Reasoning with Data", "assessment_structure": "Hands-on projects with real electoral data sets will enable students to apply their analytical skills to contemporary election scenarios. This approach enhances their ability to discern patterns and draw meaningful conclusions about modern political campaigns and voter behavior. Assignments include problem sets, data analysis projects, and a final paper that requires a comprehensive analysis of a recent American election. Students will investigate current electoral patterns, understanding their roots in historical contexts, and exploring potential future implications.", "relevance": "DC: Contextual Thinking", "learning_resources": "All course materials will be provided via Canvas.", "extra_time_commitment": "None, though election related activities will be offered."}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}