{"code": "98-387", "name": "Student Taught Courses (StuCo): The Schitt's Creek StuCo", "base_name": "Student Taught Courses (StuCo): The Schitt's Creek StuCo", "units": 3.0, "min_units": 3.0, "max_units": 3.0, "short_name": "STUCO: SCHITTS CREEK", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [1], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [{"semester": 1, "year": 2021}], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "Schitts Creek 20152020 is a Canadian comedy series that follows the struggles of the previously wealthy Rose family in the small town of Schitts Creek. Over the course of 6 seasons, Schitts Creek has been nominated for 172 awards, winning 64 of these. In this course we will watch various episodes from the show and discuss why Schitts Creek has become such a cultural phenomenon. We will discuss topics such as LGBTQ representation, mental health, understanding others, perseverance, and effective comedy techniques. We will be watching episodes from every season of Schitts Creek, so this course is open to everyone whether you have seen the entire show or havent seen a single episode. COURSE FEE Students must maintain a monthly subscription to either Hulu or Netflix throughout this course  EST 69mo for 4 mos.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "intermittent", "type": "INFO"}], "website": null, "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "repeat_limit_attempts": null, "repeat_limit_credits": null, "catalog_levels": [], "skills": [], "attributes": [], "custom_fields": {"goals": "The main goal is to have people see and appreciate the art of Schitts Creek. Broadly, we want people to understand the dynamics between characters and the situations that they encounter, and be able to apply these to the real world. We can learn how to better ourselves and society by watching Schitts Creek, and we hope to demonstrate this to our students.", "key_topics": "Overall we will be analyzing important social issues (empathy, wealth disparities, LGBTQ+ awareness, etc.) through the lens of Schitt's Creek. Schitt's Creek is also just a hilarious show that will hopefully be a place of comfort for students throughout the semester.", "prerequisite_knowledge": null, "assessment_structure": "We will have weekly homework's that will consist of questions to assess whether people are paying attention to the episodes, as well as discussion questions. There will be a final and a midterm that will be similar to the weekly homeworks but longer.", "relevance": "This course will provide a safe place for students to learn and talk about social issues that are prevalent in our society. All students will benefit from the methodical approach from which the show's writers tackle these issues. The comedy is also relevant to college-age students, and people will hopefully find it funny.", "learning_resources": "We will provide articles about the show and cast, as well as educational YouTube videos to accompany the topics being discussed. Otherwise, not much else will be needed. If a student does need any other resource they can definitely come talk to us and we will help provide that for them.", "extra_time_commitment": "There will be weekly homeworks, and a midterm and final. The weekly homeworks should take no more than 15-20 mins every week, and the midterm and final will be ~30-40 mins. We will also post suggested viewings. Since Schitt's Creek has ~70 episodes, we will not be able to watch every episode in class. We therefore post suggested episodes that we will not cover in class for students to view in their free time if they would like. Sometimes we will require outside viewing, but most of the time we will not."}, "grade_option": {"name": "Pass/Fail", "short_name": "P", "never_graded": false, "is_pass_fail": true, "is_audit": false, "id": 4}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}