{"code": "99-263", "name": "Centering Diversity, Equity, and Inclusion in Course Design & Teaching", "base_name": "Centering Diversity, Equity, and Inclusion in Course Design & Teaching", "units": 6.0, "min_units": 6.0, "max_units": 6.0, "short_name": "DEI IN TEACHING", "is_topic": false, "topic": null, "prereqs": {"text": "", "req_obj": null, "raw_pre_req": ""}, "offered_in_campuses": [], "offerings": [{"campus_id": 10, "semesters": [], "sub_semesters": []}, {"campus_id": 2, "semesters": [], "sub_semesters": []}, {"campus_id": 11, "semesters": [], "sub_semesters": []}, {"campus_id": 9, "semesters": [], "sub_semesters": []}, {"campus_id": 14, "semesters": [], "sub_semesters": []}, {"campus_id": 13, "semesters": [], "sub_semesters": []}, {"campus_id": 15, "semesters": [], "sub_semesters": []}, {"campus_id": 16, "semesters": [], "sub_semesters": []}, {"campus_id": 17, "semesters": [], "sub_semesters": []}, {"campus_id": 1, "semesters": [], "sub_semesters": []}, {"campus_id": 18, "semesters": [], "sub_semesters": []}, {"campus_id": 19, "semesters": [], "sub_semesters": []}, {"campus_id": 12, "semesters": [], "sub_semesters": []}, {"campus_id": 8, "semesters": [], "sub_semesters": []}], "co_reqs": [], "anti_reqs": [], "equiv": [], "long_desc": "Issues of diversity, equity, and inclusion, commonly referred to as DEI, are becoming more prevalent in discussions about teaching in higher education. DEI not only affects students sense of belonging in the classroom, but also their overall motivation, learning and success in and beyond the classroom and future careers.   Throughout this course, together, we will explore various topics related to DEI, beginning with an exploration of our own identities and those of our students, as well as other factors that influence DEI in the classroom. After understanding how identity influences the teaching and learning, we will learn about various frameworks, research, and evidencebased practices that can be used and applied in the classroom to overcome issues of DEI in classroom climate, course design, and inclass activities. To demonstrate understanding of course concepts, students will participate inclass activities, complete weekly reflections, apply concepts in small homework assignments, and complete a final project proposed by each individual student, to showcase their personal understanding and path related to DEI.   The aim of this course is to prepare students to work in higher education, as educators, policy makers, or curriculum design specialists, to create classrooms that welcome, support, and respond to all students unique backgrounds and experiences. This course is also designed to accommodate students perspectives, interests, and knowledge regarding DEI, as students will have input regarding the the course content and assignments.", "student_sets": [{"id": 896, "name": "undergraduate"}], "offering_tags": [{"name": "intermittent", "type": "INFO"}], "website": null, "instructors": [], "is_repeatable": false, "is_req_repeatable": false, "repeat_limit_attempts": null, "repeat_limit_credits": null, "catalog_levels": [], "skills": [], "attributes": [{"name": "diversity", "id": 3, "type": "attribute"}, {"name": "for non-majors", "id": 6, "type": "attribute"}, {"name": "equity & inclusion", "id": 23, "type": "attribute"}], "custom_fields": {"goals": "Through this course, students willReflect on their identities, experiences, and bias and the connection to teaching and learningExplain influence of sense of belonging, identity, implicit bias, and stereotype threat on teaching and learning Apply, adapt, and incorporate inclusive teaching frameworks and strategies to course design and teaching practicesAssess curriculum, policies, and practices to identify patterns and approaches to thinking about diversity, equity, and inclusion", "key_topics": "Throughout the course, students will learn various topics related to DEI, including frameworks, research, and evidence-based practices related to: identity & intersectionality, sense of belonging, implicit bias, stereotype threat, culturally responsive teaching, universal design for learning, course design, pedagogy, and beyond. Students will have the opportunity to choose additional topics and areas of study.", "prerequisite_knowledge": "There is no prior knowledge that students must have; however, students should come to the course prepared to engage with a variety of perspectives and reflect on their own positionalities and background.", "assessment_structure": "Students will prepare for class through reviewing sources and then engage in a variety of in-class activities, including discussions, pair/small group work, and individual opportunities. Assignments will include weekly reflective prompts, small homework assignments that apply course material, and a final cumulative project (to be proposed by individual students).", "relevance": "This course is designed to support students who are interested in a future career in education (either as instructors, curriculum designers, or policy makers). Students will acquire knowledge and skills to integrate diversity, equity, and inclusion into higher education classrooms and universities.", "learning_resources": "The course will use a variety of resources, including academic journal articles, fiction & non-fiction texts, podcasts, videos, artwork, and more.", "extra_time_commitment": "There are no extra time commitments required outside of the regularly scheduled course meeting times and assignments."}, "grade_option": {"name": "Pass/Fail", "short_name": "P", "never_graded": false, "is_pass_fail": true, "is_audit": false, "id": 4}, "admin_context": {"suggested_by_advisor": null, "counts_for": []}, "success": true}